cfg/Documents/ПриемНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПриемНаРаботу</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлановыеНачисления</xr:Item>
				<xr:Item>InformationRegister.Сотрудники</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПриема</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cfg/Documents/ПриемНаРаботу/Ext/ManagerModule.bsl
Функция ПечатьПриемНаРаботу(Ссылка) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.ПриемНаРаботу.ПолучитьМакет("ПриемНаРаботу");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Наименование = Ссылка.Организация.НаименованиеПолное;
	ОбластьЗаголовок.Параметры.Номер = Ссылка.Номер;
	ОбластьЗаголовок.Параметры.Дата = Ссылка.Дата;
	ТабДок.Вывести(ОбластьЗаголовок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриемНаРаботуНачисления.ВидНачисления КАК ВидНачисления,
	               |	ПриемНаРаботуСотрудники.Сотрудник КАК Сотрудник,
	               |	ПриемНаРаботуСотрудники.Подразделение КАК Подразделение,
	               |	ПриемНаРаботуСотрудники.Должность КАК Должность,
	               |	ПриемНаРаботуНачисления.Сумма КАК Сумма
	               |ИЗ
	               |	Документ.ПриемНаРаботу.Начисления КАК ПриемНаРаботуНачисления
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботу.Сотрудники КАК ПриемНаРаботуСотрудники
	               |		ПО ПриемНаРаботуНачисления.КлючСвязи = ПриемНаРаботуСотрудники.КлючСвязи
	               |ГДЕ
	               |	ПриемНаРаботуНачисления.Ссылка = &Ссылка
	               |	И ПриемНаРаботуСотрудники.Ссылка = &Ссылка
	               |ИТОГИ
	               |	МАКСИМУМ(Сумма)
	               |ПО
	               |	ВидНачисления,
	               |	Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	ВыборкаВидНачисления = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьИнформация = Макет.ПолучитьОбласть("Шапка|Информация");
	ТабДок.Вывести(ОбластьИнформация);
	
	ОбластьВидНачисления = Макет.ПолучитьОбласть("Шапка|ВидНачисления");
	ОбластьПодпись = Макет.ПолучитьОбласть("Шапка|Подпись");
	
	Пока ВыборкаВидНачисления.Следующий() Цикл
		
		ОбластьВидНачисления.Параметры.ВидНачисления = ВыборкаВидНачисления.ВидНачисления;
		ТабДок.Присоединить(ОбластьВидНачисления);
		
	КонецЦикла;
	
	ТабДок.Присоединить(ОбластьПодпись);
	
	ОбластьИнформация = Макет.ПолучитьОбласть("Строка|Информация");
	ОбластьВидНачисления = Макет.ПолучитьОбласть("Строка|ВидНачисления");
	ОбластьПодпись = Макет.ПолучитьОбласть("Строка|Подпись");
	
	ВыборкаСотрудники = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Сотрудник");
	Пока ВыборкаСотрудники.Следующий() Цикл
		
		ОбластьИнформация.Параметры.Сотрудник = ВыборкаСотрудники.Сотрудник;
		ОбластьИнформация.Параметры.Подразделение = ВыборкаСотрудники.Подразделение;
		ОбластьИнформация.Параметры.Должность = ВыборкаСотрудники.Должность;
		ТабДок.Вывести(ОбластьИнформация);
		
		ВыборкаНачисление = ВыборкаСотрудники.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидНачисления", "ВСЕ");
		Пока ВыборкаНачисление.Следующий() Цикл
			ОбластьВидНачисления.Параметры.ВидНачисления = ВыборкаНачисление.Сумма;
			ТабДок.Присоединить(ОбластьВидНачисления);
		КонецЦикла;
		
		ТабДок.Присоединить(ОбластьПодпись);
		
	КонецЦикла;
	
	Возврат ТабДок;
		
КонецФункции
